{"keras_version": "1.2.1", "class_name": "Model", "config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 9, 32, 3], "input_dtype": "float32", "sparse": false, "name": "input_1"}}, {"name": "convolution2d_1", "class_name": "Convolution2D", "inbound_nodes": [[["input_1", 0, 0]]], "config": {"bias": true, "b_regularizer": null, "dim_ordering": "tf", "border_mode": "same", "trainable": true, "init": "glorot_uniform", "W_regularizer": null, "name": "convolution2d_1", "activity_regularizer": null, "nb_row": 2, "subsample": [1, 1], "W_constraint": null, "activation": "linear", "nb_filter": 16, "nb_col": 2, "b_constraint": null}}, {"name": "activation_1", "class_name": "Activation", "inbound_nodes": [[["convolution2d_1", 0, 0]]], "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"name": "maxpooling2d_1", "class_name": "MaxPooling2D", "inbound_nodes": [[["activation_1", 0, 0]]], "config": {"name": "maxpooling2d_1", "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "strides": [2, 2], "pool_size": [2, 2]}}, {"name": "dropout_1", "class_name": "Dropout", "inbound_nodes": [[["maxpooling2d_1", 0, 0]]], "config": {"trainable": true, "name": "dropout_1", "p": 0.5}}, {"name": "convolution2d_2", "class_name": "Convolution2D", "inbound_nodes": [[["dropout_1", 0, 0]]], "config": {"bias": true, "b_regularizer": null, "dim_ordering": "tf", "border_mode": "same", "trainable": true, "init": "glorot_uniform", "W_regularizer": null, "name": "convolution2d_2", "activity_regularizer": null, "nb_row": 3, "subsample": [1, 1], "W_constraint": null, "activation": "linear", "nb_filter": 32, "nb_col": 3, "b_constraint": null}}, {"name": "activation_2", "class_name": "Activation", "inbound_nodes": [[["convolution2d_2", 0, 0]]], "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"name": "maxpooling2d_2", "class_name": "MaxPooling2D", "inbound_nodes": [[["activation_2", 0, 0]]], "config": {"name": "maxpooling2d_2", "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "strides": [2, 2], "pool_size": [2, 2]}}, {"name": "convolution2d_3", "class_name": "Convolution2D", "inbound_nodes": [[["maxpooling2d_2", 0, 0]]], "config": {"bias": true, "b_regularizer": null, "dim_ordering": "tf", "border_mode": "same", "trainable": true, "init": "glorot_uniform", "W_regularizer": null, "name": "convolution2d_3", "activity_regularizer": null, "nb_row": 5, "subsample": [1, 1], "W_constraint": null, "activation": "linear", "nb_filter": 64, "nb_col": 5, "b_constraint": null}}, {"name": "activation_3", "class_name": "Activation", "inbound_nodes": [[["convolution2d_3", 0, 0]]], "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"name": "maxpooling2d_3", "class_name": "MaxPooling2D", "inbound_nodes": [[["activation_3", 0, 0]]], "config": {"name": "maxpooling2d_3", "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "strides": [2, 2], "pool_size": [2, 2]}}, {"name": "flatten_1", "class_name": "Flatten", "inbound_nodes": [[["maxpooling2d_3", 0, 0]]], "config": {"trainable": true, "name": "flatten_1"}}, {"name": "dropout_2", "class_name": "Dropout", "inbound_nodes": [[["flatten_1", 0, 0]]], "config": {"trainable": true, "name": "dropout_2", "p": 0.5}}, {"name": "dense_1", "class_name": "Dense", "inbound_nodes": [[["dropout_2", 0, 0]]], "config": {"bias": true, "b_regularizer": null, "trainable": true, "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null, "name": "dense_1", "W_constraint": null, "activation": "linear", "b_constraint": null, "output_dim": 1164, "input_dim": 256}}, {"name": "activation_4", "class_name": "Activation", "inbound_nodes": [[["dense_1", 0, 0]]], "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"name": "dense_2", "class_name": "Dense", "inbound_nodes": [[["activation_4", 0, 0]]], "config": {"bias": true, "b_regularizer": null, "trainable": true, "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null, "name": "dense_2", "W_constraint": null, "activation": "linear", "b_constraint": null, "output_dim": 100, "input_dim": 1164}}, {"name": "activation_5", "class_name": "Activation", "inbound_nodes": [[["dense_2", 0, 0]]], "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"name": "dense_3", "class_name": "Dense", "inbound_nodes": [[["activation_5", 0, 0]]], "config": {"bias": true, "b_regularizer": null, "trainable": true, "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null, "name": "dense_3", "W_constraint": null, "activation": "linear", "b_constraint": null, "output_dim": 50, "input_dim": 100}}, {"name": "activation_6", "class_name": "Activation", "inbound_nodes": [[["dense_3", 0, 0]]], "config": {"trainable": true, "name": "activation_6", "activation": "relu"}}, {"name": "dense_4", "class_name": "Dense", "inbound_nodes": [[["activation_6", 0, 0]]], "config": {"bias": true, "b_regularizer": null, "trainable": true, "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null, "name": "dense_4", "W_constraint": null, "activation": "linear", "b_constraint": null, "output_dim": 10, "input_dim": 50}}, {"name": "dropout_3", "class_name": "Dropout", "inbound_nodes": [[["dense_4", 0, 0]]], "config": {"trainable": true, "name": "dropout_3", "p": 0.5}}, {"name": "dense_5", "class_name": "Dense", "inbound_nodes": [[["dropout_3", 0, 0]]], "config": {"bias": true, "b_regularizer": null, "trainable": true, "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null, "name": "dense_5", "W_constraint": null, "activation": "linear", "b_constraint": null, "output_dim": 1, "input_dim": 10}}], "output_layers": [["dense_5", 0, 0]]}}