{"class_name": "Model", "config": {"output_layers": [["dense_5", 0, 0]], "input_layers": [["input_1", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 32, 3], "name": "input_1", "input_dtype": "float32", "sparse": false}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Lambda", "config": {"arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001ir\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\ntrainer.py\u00da\b<lambda>\u00a4\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true, "output_shape_type": "raw", "name": "lambda_1", "function_type": "lambda", "output_shape": null}, "inbound_nodes": [[["input_1", 0, 0]]], "name": "lambda_1"}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "nb_col": 2, "b_regularizer": null, "nb_row": 2, "W_constraint": null, "b_constraint": null, "dim_ordering": "tf", "trainable": true, "activation": "linear", "nb_filter": 16, "W_regularizer": null, "border_mode": "same", "name": "convolution2d_1"}, "inbound_nodes": [[["lambda_1", 0, 0]]], "name": "convolution2d_1"}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "inbound_nodes": [[["convolution2d_1", 0, 0]]], "name": "activation_1"}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "pool_size": [2, 2], "trainable": true, "border_mode": "valid", "name": "maxpooling2d_1", "strides": [2, 2]}, "inbound_nodes": [[["activation_1", 0, 0]]], "name": "maxpooling2d_1"}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}, "inbound_nodes": [[["maxpooling2d_1", 0, 0]]], "name": "dropout_1"}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "nb_col": 3, "b_regularizer": null, "nb_row": 3, "W_constraint": null, "b_constraint": null, "dim_ordering": "tf", "trainable": true, "activation": "linear", "nb_filter": 32, "W_regularizer": null, "border_mode": "same", "name": "convolution2d_2"}, "inbound_nodes": [[["dropout_1", 0, 0]]], "name": "convolution2d_2"}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "inbound_nodes": [[["convolution2d_2", 0, 0]]], "name": "activation_2"}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "pool_size": [2, 2], "trainable": true, "border_mode": "valid", "name": "maxpooling2d_2", "strides": [2, 2]}, "inbound_nodes": [[["activation_2", 0, 0]]], "name": "maxpooling2d_2"}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}, "inbound_nodes": [[["maxpooling2d_2", 0, 0]]], "name": "dropout_2"}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "nb_col": 5, "b_regularizer": null, "nb_row": 5, "W_constraint": null, "b_constraint": null, "dim_ordering": "tf", "trainable": true, "activation": "linear", "nb_filter": 64, "W_regularizer": null, "border_mode": "same", "name": "convolution2d_3"}, "inbound_nodes": [[["dropout_2", 0, 0]]], "name": "convolution2d_3"}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "inbound_nodes": [[["convolution2d_3", 0, 0]]], "name": "activation_3"}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "pool_size": [2, 2], "trainable": true, "border_mode": "valid", "name": "maxpooling2d_3", "strides": [2, 2]}, "inbound_nodes": [[["activation_3", 0, 0]]], "name": "maxpooling2d_3"}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "nb_col": 7, "b_regularizer": null, "nb_row": 7, "W_constraint": null, "b_constraint": null, "dim_ordering": "tf", "trainable": true, "activation": "linear", "nb_filter": 128, "W_regularizer": null, "border_mode": "same", "name": "convolution2d_4"}, "inbound_nodes": [[["maxpooling2d_3", 0, 0]]], "name": "convolution2d_4"}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "inbound_nodes": [[["convolution2d_4", 0, 0]]], "name": "activation_4"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}, "inbound_nodes": [[["activation_4", 0, 0]]], "name": "flatten_1"}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_3"}, "inbound_nodes": [[["flatten_1", 0, 0]]], "name": "dropout_3"}, {"class_name": "Dense", "config": {"activity_regularizer": null, "input_dim": 512, "init": "glorot_uniform", "b_regularizer": null, "output_dim": 1164, "bias": true, "W_constraint": null, "b_constraint": null, "trainable": true, "activation": "linear", "W_regularizer": null, "name": "dense_1"}, "inbound_nodes": [[["dropout_3", 0, 0]]], "name": "dense_1"}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}, "inbound_nodes": [[["dense_1", 0, 0]]], "name": "activation_5"}, {"class_name": "Dense", "config": {"activity_regularizer": null, "input_dim": 1164, "init": "glorot_uniform", "b_regularizer": null, "output_dim": 100, "bias": true, "W_constraint": null, "b_constraint": null, "trainable": true, "activation": "linear", "W_regularizer": null, "name": "dense_2"}, "inbound_nodes": [[["activation_5", 0, 0]]], "name": "dense_2"}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "relu"}, "inbound_nodes": [[["dense_2", 0, 0]]], "name": "activation_6"}, {"class_name": "Dense", "config": {"activity_regularizer": null, "input_dim": 100, "init": "glorot_uniform", "b_regularizer": null, "output_dim": 50, "bias": true, "W_constraint": null, "b_constraint": null, "trainable": true, "activation": "linear", "W_regularizer": null, "name": "dense_3"}, "inbound_nodes": [[["activation_6", 0, 0]]], "name": "dense_3"}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_7", "activation": "relu"}, "inbound_nodes": [[["dense_3", 0, 0]]], "name": "activation_7"}, {"class_name": "Dense", "config": {"activity_regularizer": null, "input_dim": 50, "init": "glorot_uniform", "b_regularizer": null, "output_dim": 10, "bias": true, "W_constraint": null, "b_constraint": null, "trainable": true, "activation": "linear", "W_regularizer": null, "name": "dense_4"}, "inbound_nodes": [[["activation_7", 0, 0]]], "name": "dense_4"}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_4"}, "inbound_nodes": [[["dense_4", 0, 0]]], "name": "dropout_4"}, {"class_name": "Dense", "config": {"activity_regularizer": null, "input_dim": 10, "init": "glorot_uniform", "b_regularizer": null, "output_dim": 1, "bias": true, "W_constraint": null, "b_constraint": null, "trainable": true, "activation": "linear", "W_regularizer": null, "name": "dense_5"}, "inbound_nodes": [[["dropout_4", 0, 0]]], "name": "dense_5"}]}, "keras_version": "1.2.1"}